codeigniter4-framework-e7753bc/app/Controllers/Trackwise/Goals.php

    public function store()
    {
        $userId = $this->requireAuth();
        if ($userId === null) {
            return redirect()->to('/trackwise/auth/login');
        }

        $rules = [
            'title'      => 'required|min_length[3]|max_length[255]',
            'category'   => 'required|in_list[Time,Consistency,Sessions,Learning]',
            'target_value' => 'required|decimal|greater_than[0]',
            'due_date'   => 'permit_empty|valid_date[Y-m-d]',
        ];

        if (! $this->validate($rules)) {
            return redirect()->back()->withInput()->with('error', implode(' ', $this->validator->getErrors()));
        }

        $model    = new GoalModel();
        $category = $this->request->getPost('category');
        $meta     = $model->getMetaForCategory($category);

        $id = $model->insert([
            'user_id'       => $userId,
            'title'         => $this->request->getPost('title'),
            'category'      => $category,
            'target_value'  => $this->request->getPost('target_value'),
            'current_value' => 0,
            'unit'          => $meta['unit'],
            'color'         => $meta['color'],
            'due_date'      => $this->request->getPost('due_date') ?: null,
            'is_completed'  => 0,
        ]);
---
INSERT INTO `goals` (`user_id`, `title`, `category`, `target_value`, `current_value`, `unit`, `color`, `due_date`, `is_completed`, `created_at`, `updated_at`) VALUES (4, '3 hour', 'Time', '3', 0, 'hours', '#42a5f5', '2026-05-31', 0, '2026-05-31 13:15:00', '2026-05-31 13:15:00')