codeigniter4-framework-e7753bc/app/Controllers/Trackwise/Profile.php

SELECT `username`, `email`, `created_at`
FROM `users`
WHERE `users`.`id` = 4
---
    public function index()
    {
        $userId = $this->requireAuth();
        if ($userId === null) {
            return redirect()->to('/trackwise/auth/login');
        }

        $profileModel = new ProfileModel();
        $studyModel   = new StudySessionModel();
        $userModel    = new UserModel();

        $stats = ['sessionCount' => 0, 'hours' => 0, 'streak' => 0];
        try {
            $stats = $studyModel->getStats($userId);
        } catch (\Throwable $e) {
            log_message('error', 'Profile stats: ' . $e->getMessage());
        }

        $user = $userModel->select('username, email, created_at')->find($userId);