codeigniter4-framework-e7753bc/app/Models/Trackwise/GoalModel.php

SELECT *
FROM `goals`
WHERE `user_id` = 4
---
    public function getSummary(int $userId): array
    {
        $goals = $this->where('user_id', $userId)->findAll();

SELECT *
FROM `goals`
WHERE `user_id` = 4
AND `is_completed` = 0
ORDER BY `due_date` ASC
---
    public function getActiveGoals(int $userId, StudySessionModel $sessionModel): array
    {
        $rows = $this->where('user_id', $userId)
            ->where('is_completed', 0)
            ->orderBy('due_date', 'ASC')
            ->findAll();