codeigniter4-framework-e7753bc/app/Models/Trackwise/StudySessionModel.php

    public function getStats(int $userId): array
    {
        $builder = $this->builder();
        $builder->select('hours, minutes, created_at')
            ->where('user_id', $userId);

        $rows = $builder->get()->getResultArray();
---
SELECT `hours`, `minutes`, `created_at`
FROM `study_sessions`
WHERE `user_id` = 4

    public function getWeeklyChart(int $userId): array
    {
        $labels  = [];
        $values  = [];
        $dayKeys = [];

        for ($i = 6; $i >= 0; $i--) {
            $date      = date('Y-m-d', strtotime("-{$i} days"));
            $dayKeys[] = $date;
            $labels[]  = date('D', strtotime($date));
            $values[]  = 0.0;
        }

        $rows = $this->select('hours, minutes, created_at')
            ->where('user_id', $userId)
            ->where('created_at >=', date('Y-m-d 00:00:00', strtotime('-6 days')))
            ->findAll();
---
SELECT `hours`, `minutes`, `created_at`
FROM `study_sessions`
WHERE `user_id` = 4
AND `created_at` >= '2026-05-25 00:00:00'

    public function getSubjectBreakdown(int $userId): array
    {
        $rows = $this->select('subject, hours, minutes')
            ->where('user_id', $userId)
            ->findAll();
---
SELECT `subject`, `hours`, `minutes`
FROM `study_sessions`
WHERE `user_id` = 4

    public function getRecentSessions(int $userId, int $limit = 5): array
    {
        return $this->select('id, subject, topic, hours, minutes, created_at')
            ->where('user_id', $userId)
            ->orderBy('created_at', 'DESC')
            ->findAll($limit);
---
SELECT `id`, `subject`, `topic`, `hours`, `minutes`, `created_at`
FROM `study_sessions`
WHERE `user_id` = 4
ORDER BY `created_at` DESC
 LIMIT 8